{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "712d90a0",
   "metadata": {},
   "source": [
    "# Model Commands\n",
    "\n",
    "Grundlegende Spielbefehle ausprobieren..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "97776981",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Docker starten ;-)\n",
      "URI: bolt://localhost:7687\n",
      "UI:  http://localhost:7474\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "load_dotenv(dotenv_path='../.env')\n",
    "\n",
    "driver = GraphDatabase.driver(\n",
    "    uri=os.getenv('NEO4J_URI'),\n",
    "    auth=(\n",
    "        os.getenv('NEO4J_USER'), \n",
    "        os.getenv('NEO4J_PASSWORD')\n",
    "    )\n",
    ")\n",
    "\n",
    "print('Docker starten ;-)')\n",
    "print(f'URI: {os.getenv(\"NEO4J_URI\")}')\n",
    "print(f'UI:  http://localhost:7474')\n",
    "\n",
    "# Queryhelper\n",
    "def run_queries(queries, params=None):\n",
    "    \n",
    "    # Ergebnisliste\n",
    "    results = []\n",
    "\n",
    "    # Liste durchgehen. Muss immer eine Liste sein, keine Normalisierung aktuell.\n",
    "    for query in queries:\n",
    "\n",
    "        # Session öffnen\n",
    "        with driver.session() as session:\n",
    "\n",
    "            # Query\n",
    "            result = session.run(query, params or {})\n",
    "\n",
    "            # Ergebnisse wegspeichern\n",
    "            records = [r.data() for r in result]\n",
    "            results.extend(records)\n",
    "\n",
    "    return results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "149d8731",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Eine alte Taverne, etwas heruntergekommen aber ein Kultobjekt.\n",
      "Finsterwald\n"
     ]
    }
   ],
   "source": [
    "# Show\n",
    "show_query = [\n",
    "    \"\"\"\n",
    "    MATCH (p:Player {id: 'player_no1'})-[:IST_IN]->(place:Location)\n",
    "    RETURN place.id, place.name, place.description\n",
    "    \"\"\",\n",
    "    \"\"\"\n",
    "    MATCH (l:Location {id: 'marktplatz'})-[:ERREICHT]->(target:Location)\n",
    "    RETURN target.id, target.name, target.description\n",
    "    \"\"\"\n",
    "]\n",
    "\n",
    "show_info = run_queries(show_query)\n",
    "\n",
    "print(show_info[0]['place.description'])\n",
    "print(show_info[1]['target.name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c49dc770",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Du bist jetzt in Mo's Taverne.\n",
      "Eine alte Taverne, etwas heruntergekommen aber ein Kultobjekt.\n",
      "\n",
      "[\"Mo's Taverne\", 'Marktplatz', 'Finsterwald']\n",
      "Du bist jetzt in Finsterwald.\n",
      "Ein dunkler, übelriechender Wald voller Geister und anderen Ängsten.\n",
      "\n",
      "[{'target.id': 'marktplatz', 'target.name': 'Marktplatz', 'target.description': 'Das ist der Markplatz des kleinen, beschaulichen Ortes.'}]\n"
     ]
    }
   ],
   "source": [
    "# Move\n",
    "move_to_taverne = [\n",
    "    \"\"\"\n",
    "    MATCH (p:Player {id: 'player_no1'})-[old:IST_IN]->(current:Location)\n",
    "    MATCH (current)-[:ERREICHT]->(target:Location {id: 'taverne'})\n",
    "    DELETE old\n",
    "    CREATE (p)-[:IST_IN]->(target)\n",
    "    RETURN target.id, target.name, target.description\n",
    "    \"\"\"\n",
    "]\n",
    "\n",
    "move_to_taverne_info = run_queries(move_to_taverne)\n",
    "\n",
    "# print(move_to_taverne_info)\n",
    "print(f\"Du bist jetzt in {move_to_taverne_info[0]['target.name']}.\")\n",
    "print(f\"{move_to_taverne_info[0]['target.description']}\")\n",
    "print()\n",
    "\n",
    "move_to_finsterwald = [\n",
    "    \"\"\"\n",
    "    MATCH (p:Player {id: 'player_no1'})-[old:IST_IN]->(current:Location)\n",
    "    MATCH path = shortestPath((current)-[:ERREICHT*]-(target:Location {id: 'finsterwald'}))\n",
    "    WHERE path IS NOT NULL\n",
    "    DELETE old\n",
    "    CREATE (p)-[:IST_IN]->(target)\n",
    "    RETURN target.id, target.name, target.description,\n",
    "        [node IN nodes(path) | node.name] AS route_taken\n",
    "    \"\"\"\n",
    "]\n",
    "\n",
    "move_to_finsterwald_info = run_queries(move_to_finsterwald)\n",
    "\n",
    "# print(move_to_finsterwald_info)\n",
    "print(move_to_finsterwald_info[0]['route_taken'])\n",
    "print(f\"Du bist jetzt in {move_to_finsterwald_info[0]['target.name']}.\")\n",
    "print(f\"{move_to_finsterwald_info[0]['target.description']}\")\n",
    "print()\n",
    "\n",
    "move_to_marktplatz = [\n",
    "    \"\"\"\n",
    "    MATCH (p:Player {id: 'player_no1'})-[old:IST_IN]->(current:Location)\n",
    "    MATCH (current)-[:ERREICHT]->(target:Location {id: 'marktplatz'})\n",
    "    DELETE old\n",
    "    CREATE (p)-[:IST_IN]->(target)\n",
    "    RETURN target.id, target.name, target.description\n",
    "    \"\"\"\n",
    "]\n",
    "\n",
    "move_to_taverne_info = run_queries(move_to_marktplatz)\n",
    "\n",
    "# print(move_to_taverne_info)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "5bc82c3b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Take"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e2039d46",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "# Use"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
